
export const events = [
    {
        year: -5500,
        description: "Початок Трипільської культури",
        details: "Близько 5500 року до н.е. на території сучасної України виникла одна з найяскравіших неолітичних культур — Трипільська культура. Вона характеризувалася високим рівнем розвитку землеробства, гончарства та житлового будівництва.",
        period: "Стародавній світ",
        image: "/images/trypillia.jpg"
    },
    {
        year: -700,
        description: "Заснування грецьких колоній у Північному Причорномор’ї",
        details: "У VII столітті до н.е. греки почали засновувати міста-колонії в Північному Причорномор’ї, такі як Ольвія, Тіра та Херсонес.",
        period: "Стародавній світ",
        image: "/images/greek_colonies.jpg"
    },
    {
        year: -200,
        description: "Сармати на території України",
        details: "Сармати — кочові племена, що в II ст. до н.е. витіснили скіфів і тривалий час контролювали степову зону сучасної України.",
        period: "Стародавній світ",
        image: "/images/sarmatians.jpg"
    },
    {
        year: 375,
        description: "Нашестя гунів і занепад Античних держав у Причорномор’ї",
        details: "У 375 році гунські орди розгромили остготів у Причорномор'ї, що стало початком Великого переселення народів.",
        period: "Стародавній світ",
        image: "/images/huns.jpg"
    },
    {
        year: 860,
        description: "Похід русів на Константинополь",
        details: "У 860 році київські князі здійснили похід на Константинополь, що засвідчило силу формуючоїся держави на території України.",
        period: "Стародавній світ",
        image: "/images/rusy.jpg"
    },
    {
        year: 882,
        description: "Об'єднання Києва та Новгорода князем Олегом",
        details: "Князь Олег об'єднав Київ і Новгород, створивши потужну державу — Київську Русь. Це стало важливим етапом в історії середньовічної України.",
        period: "Середньовіччя",
        image: "/images/okn.jpg"
    },
    {
        year: 988,
        description: "Хрещення Русі князем Володимиром Великим",
        details: "У 988 році князь Володимир Великий охрестив Київську Русь, прийнявши християнство, що мало глибокий вплив на розвиток культури та політики держави.",
        period: "Середньовіччя",
        image: "/images/hr.jpg"
    },
    {
        year: 1037,
        description: "Зведення Софійського собору в Києві",
        details: "Князь Ярослав Мудрий збудував Софійський собор — визначну архітектурну пам’ятку Київської Русі, яка стала духовним та культурним центром держави.",
        period: "Середньовіччя",
        image: "/images/sofia.jpg"
    },
    {
        year: 1054,
        description: "Смерть Ярослава Мудрого та поділ Київської Русі",
        details: "Після смерті Ярослава Мудрого держава була поділена між його синами, що зумовило початок процесу феодальної роздробленості.",
        period: "Середньовіччя",
        image: "/images/yaroslav.jpg"
    },
    {
        year: 1187,
        description: "Перша писемна згадка назви «Україна»",
        details: "У літописі згадується слово «Україна» в контексті Переяславської землі — перший відомий документ, де згадується ця назва.",
        period: "Середньовіччя",
        image: "/images/ukraina1187.jpg"
    },
    {
        year: 1223,
        description: "Битва на річці Калка",
        details: "Битва об'єднаних руських і половецьких військ з монголами. Завершилася поразкою русько-половецької коаліції. Це була перша зустріч Русі з монголо-татарами.",
        period: "Середньовіччя",
        image: "/images/kalka.jpg"
    },
    {
        year: 1240,
        description: "Захоплення Києва монголо-татарами",
        details: "У грудні 1240 року війська хана Батия захопили Київ, що стало однією з найважливіших подій в історії України та призвело до тривалого періоду монголо-татарського поневолення.",
        period: "Середньовіччя",
        image: "/images/zkm.jpg"
    },
    {
        year: 1362,
        description: "Битва на Синіх Водах",
        details: "Військо Великого князівства Литовського здобуло перемогу над Золотою Ордою. Ця подія сприяла звільненню українських земель від ординського панування.",
        period: "Середньовіччя",
        image: "/images/syni_vody.jpg"
    },
    {
        year: 1556,
        description: "Заснування Запорізької Січі",
        details: "Заснування першої Запорізької Січі на острові Мала Хортиця, що стало центром козацької влади та оборони на південному заході України.",
        period: "Новий час",
        image: "/images/zapor_sich.jpg"
      },
      {
        year: 1591,
        description: "Козацьке повстання під проводом Криштофа Косинського",
        details: "Повстання проти польської влади, організоване козаками, яке включало перші значні сутички між козаками та польською армією.",
        period: "Новий час",
        image: "/images/koz_povst.jpg"
      },
    {
        year: 1648,
        description: "Початок Національно-визвольної війни",
        details: "У 1648 році Богдан Хмельницький очолив повстання проти Речі Посполитої. Почалася Національно-визвольна війна, яка призвела до створення козацької держави — Гетьманщини.",
        period: "Новий час",
        image: "/images/nvv.jpg"
    },
    {
        year: 1654,
        description: "Переяславська угода",
        details: "Підписання Переяславської угоди між Московією та Українським козацтвом, що фактично призвело до приєднання Лівобережної України до Московії.",
        period: "Новий час",
        image: "/images/pereyaslav.jpg"
      },
      {
        year: 1775,
        description: "Знищення Запорізької Січі Катериною II",
        details: "Катерина II остаточно ліквідувала Запорізьку Січ, розпочавши процес інтеграції українських земель до складу Російської імперії.",
        period: "Новий час",
        image: "/images/sich_destruction.jpg"
      },
    {
        year: 1918,
        description: "Проголошення незалежності УНР",
        details: "22 січня 1918 року Українська Центральна Рада проголосила незалежність Української Народної Республіки (УНР) у IV Універсалі.",
        period: "Новітній час",
        image: "/images/1918.jpg"
    },
    {
        year: 1939,
        description: "Початок Другої світової війни",
        details: "1 вересня 1939 року нацистська Німеччина напала на Польщу, що стало початком Другої світової війни. 17 вересня Червона армія вторглася у східну частину Польщі.",
        period: "Новітній час",
        image: "/images/ww2.png"
    },
    {
        year: 1941,
        description: "Напад Німеччини на СРСР (Операція Барбаросса)",
        details: "22 червня 1941 року Німеччина розпочала військову операцію «Барбаросса», в ході якої Вермахт швидко просунувся на схід, окупувавши значну частину України.",
        period: "Новітній час",
        image: "/images/barbarossa.jpg"
    },
    {
        year: 1991,
        description: "Проголошення незалежності України",
        details: "24 серпня 1991 року Верховна Рада України ухвалила Акт проголошення незалежності України, що поклало початок сучасній українській державності.",
        period: "Новітній час",
        image: "/images/independence1991.jpg"
    },
    {
        year: 1994,
        description: "Будапештський меморандум",
        details: "5 грудня 1994 року Україна підписала Будапештський меморандум з США, Великобританією та Росією. В обмін на відмову від ядерної зброї Україна отримала гарантії територіальної цілісності та недоторканності своїх кордонів.",
        period: "Новітній час",
        image: "/images/bm.avif"
    },
    {
        year: 2004,
        description: "Помаранчева революція",
        details: "У 2004 році в Україні відбулись масові протестні акції, що призвели до зміни результатів президентських виборів. Помаранчева революція стала символом боротьби за демократію і права людини.",
        period: "Новітній час",
        image: "/images/orange.webp"
    },
    {
        year: 2014,
        description: "Євромайдан та Революція Гідності",
        details: "У листопаді 2013 року почались масові протести в Україні після відмови президента Януковича підписати Угоду про асоціацію з ЄС. Протести призвели до Революції Гідності та втечі Януковича, що змінило політичний курс України.",
        period: "Новітній час",
        image: "/images/euromaidan.jpg"
    },
    {
        year: 2022,
        description: "Повномасштабне вторгнення Росії в Україну",
        details: "24 лютого 2022 року росія розпочала повномасштабне військове вторгнення в Україну. Цей напад став найбільшим збройним конфліктом у Європі за останні десятиліття, що спричинило величезні людські втрати, руйнування інфраструктури та зміни в політичній ситуації в Україні та світі. ",
        period: "Новітній час",
        image: "/images/2022.jpg"
    }
];

